sabarioded/stm32_cli_os/startup/stm32l476_startup.c
// end of chapter 4 theres a install guide
#include <stdint.h>

/* Linker script symbols */
extern uint32_t _estack;   // Initial stack pointer
extern uint32_t _sidata;   // Start of init values for .data in FLASH
extern uint32_t _sdata;    // Start of .data in SRAM
extern uint32_t _edata;    // End of .data in SRAM
extern uint32_t _sbss;     // Start of .bss in SRAM
extern uint32_t _ebss;     // End of .bss in SRAM

/* Forward declarations */
void Reset_Handler(void);
void Default_Handler(void);
int main(void);


/* ---------- Core exception handlers (weak -> Default_Handler) ---------- */
void NMI_Handler                (void) __attribute__((weak, alias("Default_Handler")));
void HardFault_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void MemManage_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void BusFault_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void UsageFault_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void SVC_Handler                (void) __attribute__((weak, alias("Default_Handler")));
void DebugMon_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void PendSV_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void SysTick_Handler            (void) __attribute__((weak, alias("Default_Handler")));

/* ---------- STM32L476 peripheral IRQ handlers (weak -> Default_Handler) ---------- */
void WWDG_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void PVD_PVM_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void TAMP_STAMP_IRQHandler      (void) __attribute__((weak, alias("Default_Handler")));
void RTC_WKUP_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void FLASH_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void RCC_IRQHandler             (void) __attribute__((weak, alias("Default_Handler")));
void EXTI0_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void EXTI1_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void EXTI2_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void EXTI3_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void EXTI4_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel1_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel2_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel3_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel4_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel5_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel6_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel7_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void ADC1_2_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_TX_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_RX0_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_RX1_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_SCE_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void EXTI9_5_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_BRK_TIM15_IRQHandler  (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_UP_TIM16_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_TRG_COM_TIM17_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TIM1_CC_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void TIM2_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void TIM3_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void TIM4_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void I2C1_EV_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void I2C1_ER_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void I2C2_EV_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void I2C2_ER_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void SPI1_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void SPI2_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void USART1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void USART2_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void USART3_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI15_10_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void RTC_Alarm_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM3_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_BRK_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_UP_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_TRG_COM_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_CC_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void ADC3_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void FMC_IRQHandler             (void) __attribute__((weak, alias("Default_Handler")));
void SDMMC1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM5_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void SPI3_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void UART4_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void UART5_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void TIM6_DAC_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void TIM7_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Channel1_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Channel2_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Channel3_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Channel4_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Channel5_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM0_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM2_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void COMP_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void LPTIM1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void LPTIM2_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void OTG_FS_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Channel6_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Channel7_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void LPUART1_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void QUADSPI_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void I2C3_EV_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void I2C3_ER_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void SAI1_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void SAI2_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void SWPMI1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TSC_IRQHandler             (void) __attribute__((weak, alias("Default_Handler")));
void LCD_IRQHandler             (void) __attribute__((weak, alias("Default_Handler")));
void RNG_IRQHandler             (void) __attribute__((weak, alias("Default_Handler")));
void FPU_IRQHandler             (void) __attribute__((weak, alias("Default_Handler")));

/* ---------- Vector table ---------- */
__attribute__((section(".isr_vector")))
__attribute__((used))
void (* const g_pfnVectors[])(void) = {
    (void (*)(void))(&_estack),      // Initial Stack Pointer
    Reset_Handler,                   // Reset
    NMI_Handler,                     // NMI
    HardFault_Handler,               // HardFault
    MemManage_Handler,               // MemManage
    BusFault_Handler,                // BusFault
    UsageFault_Handler,              // UsageFault
    0, 0, 0, 0,                      // Reserved
    SVC_Handler,                     // SVCall
    DebugMon_Handler,                // DebugMon
    0,                               // Reserved
    PendSV_Handler,                  // PendSV
    SysTick_Handler,                 // SysTick

    /* External Interrupts */
    WWDG_IRQHandler,
    PVD_PVM_IRQHandler,
    TAMP_STAMP_IRQHandler,
    RTC_WKUP_IRQHandler,
    FLASH_IRQHandler,
    RCC_IRQHandler,
    EXTI0_IRQHandler,
    EXTI1_IRQHandler,
    EXTI2_IRQHandler,
    EXTI3_IRQHandler,
    EXTI4_IRQHandler,
    DMA1_Channel1_IRQHandler,
    DMA1_Channel2_IRQHandler,
    DMA1_Channel3_IRQHandler,
    DMA1_Channel4_IRQHandler,
    DMA1_Channel5_IRQHandler,
    DMA1_Channel6_IRQHandler,
    DMA1_Channel7_IRQHandler,
    ADC1_2_IRQHandler,
    CAN1_TX_IRQHandler,
    CAN1_RX0_IRQHandler,
    CAN1_RX1_IRQHandler,
    CAN1_SCE_IRQHandler,
    EXTI9_5_IRQHandler,
    TIM1_BRK_TIM15_IRQHandler,
    TIM1_UP_TIM16_IRQHandler,
    TIM1_TRG_COM_TIM17_IRQHandler,
    TIM1_CC_IRQHandler,
    TIM2_IRQHandler,
    TIM3_IRQHandler,
    TIM4_IRQHandler,
    I2C1_EV_IRQHandler,
    I2C1_ER_IRQHandler,
    I2C2_EV_IRQHandler,
    I2C2_ER_IRQHandler,
    SPI1_IRQHandler,
    SPI2_IRQHandler,
    USART1_IRQHandler,
    USART2_IRQHandler,
    USART3_IRQHandler,
    EXTI15_10_IRQHandler,
    RTC_Alarm_IRQHandler,
    DFSDM3_IRQHandler,
    TIM8_BRK_IRQHandler,
    TIM8_UP_IRQHandler,
    TIM8_TRG_COM_IRQHandler,
    TIM8_CC_IRQHandler,
    ADC3_IRQHandler,
    FMC_IRQHandler,
    SDMMC1_IRQHandler,
    TIM5_IRQHandler,
    SPI3_IRQHandler,
    UART4_IRQHandler,
    UART5_IRQHandler,
    TIM6_DAC_IRQHandler,
    TIM7_IRQHandler,
    DMA2_Channel1_IRQHandler,
    DMA2_Channel2_IRQHandler,
    DMA2_Channel3_IRQHandler,
    DMA2_Channel4_IRQHandler,
    DMA2_Channel5_IRQHandler,
    DFSDM0_IRQHandler,
    DFSDM1_IRQHandler,
    DFSDM2_IRQHandler,
    COMP_IRQHandler,
    LPTIM1_IRQHandler,
    LPTIM2_IRQHandler,
    OTG_FS_IRQHandler,
    DMA2_Channel6_IRQHandler,
    DMA2_Channel7_IRQHandler,
    LPUART1_IRQHandler,
    QUADSPI_IRQHandler,
    I2C3_EV_IRQHandler,
    I2C3_ER_IRQHandler,
    SAI1_IRQHandler,
    SAI2_IRQHandler,
    SWPMI1_IRQHandler,
    TSC_IRQHandler,
    LCD_IRQHandler,
    0,                // Reserved in table
    RNG_IRQHandler,
    FPU_IRQHandler
};

/* ---------- Reset handler ---------- */
void Reset_Handler(void)
{
    /* 1) Copy .data from FLASH to SRAM */
    uint32_t *src = &_sidata;
    uint32_t *dst = &_sdata;
    while (dst < &_edata) {
        *dst++ = *src++;
    }

    /* 2) Zero initialize .bss */
    for (uint32_t *b = &_sbss; b < &_ebss; ++b) {
        *b = 0;
    }

    /* 4) Jump to main */
    (void)main();

    /* If main() returns, loop forever */
    while (1) { }
}

/* ---------- Default handler ---------- */
void Default_Handler(void)
{
    while (1) { /* trap */ }
}
